Revit 2027 API
AdvancedWood.WoodDiffusePerlinEnable Property
 The property labeled "Use perlin function for diffuse albedo" from the "AdvancedWood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string WoodDiffusePerlinEnable { get; }
Public Shared ReadOnly Property WoodDiffusePerlinEnable As String
	Get
public:
static property String^ WoodDiffusePerlinEnable {
	String^ get ();
}
static member WoodDiffusePerlinEnable : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyBoolean".
See Also
Reference
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace